# GetCategories Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterCategoryRule..::..GetCategories Method
FilterCategoryRule Class See Also
---
Gets the rule's categories.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICollection<ElementId> GetCategories()
```

Visual Basic
---
```text
Public Function GetCategories As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetCategories()
```

# See Also
FilterCategoryRule Class
Autodesk.Revit.DB Namespace